app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("name", "ingredients", "steps", "images", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    #parse ingredients and steps
    @recipe = Recipe.new(recipe_params)
    if @recipe.save