app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    @users = User.all

INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save